{
  "backend/main.mo": "Main Motoko actor for the Gambia Market backend, defining data types (UserProfile, Listing, Message, Transaction, Review, Report) and state maps, with mixed-in blob storage and authorization, plus public query/update methods for user profiles, listings, messaging, transactions, reviews, and reports.",
  "feature_evidence.json": "JSON report mapping implemented feature IDs to their titles, associated source files, component dependencies, test IDs, and confidence levels for PWA manifest/service worker and InstallBanner features.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of each frontend source file, covering styles, Tailwind config, TypeScript types, static data modules, and React components.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "HTML entry point for the React app that includes PWA manifest link, iOS/Android meta tags for home screen installation, theme color, and mounts the app at the root div.",
  "frontend/public/manifest.json": "PWA web app manifest for Gambia Market specifying app name, short name, start URL, standalone display mode, brand green theme color, and 192×192/512×512 icon entries.",
  "frontend/public/sw.js": "Minimal service worker that caches the app shell (index.html and root) on install, cleans old caches on activate, and serves cached responses with a network fallback and offline navigation support.",
  "frontend/src/App.tsx": "Root React component managing client-side page routing via a discriminated union AppPage state, rendering pages (HomeFeed, CreateListing, Chat, Profile, ListingDetail, etc.), the AppHeader, BottomNav, InstallBanner, and Toaster.",
  "frontend/src/components/AppHeader.tsx": "Sticky top header component for Gambia Market with a logo, optional Kente accent line, and search/profile icon buttons.",
  "frontend/src/components/AuthGuard.tsx": "Route guard that checks Internet Identity authentication and user profile existence, rendering loading states, a login prompt, or a profile setup flow before showing children.",
  "frontend/src/components/BoostedListingMockup.tsx": "Visual mockup component showing a side-by-side comparison of a standard vs. boosted listing card, along with a primary revenue driver banner.",
  "frontend/src/components/BoostModal.tsx": "Dialog modal that displays available boost duration/price options for a listing and triggers the boost mutation on selection.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with five tabs (Home, Search, Sell, Chat, Profile) that highlights the active tab and shows an unread message badge on the Chat tab.",
  "frontend/src/components/CategoryFilter.tsx": "Horizontally scrollable pill-button filter bar for listing categories, showing emoji icons and optional per-category listing counts.",
  "frontend/src/components/ChatMockup.tsx": "Static UI mockup of a chat conversation tied to a listing, rendering a header with listing context, a scrollable message list, and a dummy input bar.",
  "frontend/src/components/ConversationItem.tsx": "Row component for a conversation list that displays the other user's name, listing thumbnail, last message preview, and relative timestamp.",
  "frontend/src/components/DatabaseStructureSection.tsx": "Blueprint section that renders a grid of EntityCard components sourced from static database entity data to document the backend schema.",
  "frontend/src/components/EditProfileForm.tsx": "A form component for editing a user's name and location, using the useUpdateUser mutation hook and displaying toast notifications on success or failure.",
  "frontend/src/components/EntityCard.tsx": "Displays a database entity's name, description, fields (in a table), and relationships in a styled card layout.",
  "frontend/src/components/FeatureBreakdownSection.tsx": "Renders the full 'Core Feature Breakdown' section by iterating over features data and conditionally rendering various mockup/detail sub-components based on each feature's properties.",
  "frontend/src/components/FeatureCard.tsx": "Displays a single feature's icon, category badge, title, and description in a styled card, mapping feature icon strings to Lucide React components.",
  "frontend/src/components/FeaturedListingsRow.tsx": "A horizontally scrollable row of featured listing cards showing photo, title, price, and location, with click handlers to navigate to individual listings.",
  "frontend/src/components/FulfillmentOptionsCard.tsx": "Renders a grid of fulfillment option cards (delivery or meet-up) with icons, descriptions, and sample form fields for each option type.",
  "frontend/src/components/FutureFeatureCard.tsx": "Displays a single future feature card with its title, description, and a phase badge (Phase 2 or Phase 3) with corresponding color styling.",
  "frontend/src/components/FutureFeaturesSection.tsx": "Renders the 'Future Features' section split into Phase 2 and Phase 3 grids of FutureFeatureCard components sourced from static data.",
  "frontend/src/components/GuestNamePrompt.tsx": "A dialog that prompts unauthenticated users to enter a guest display name before messaging a seller, with an alternative option to log in via Internet Identity.",
  "frontend/src/components/HeroSection.tsx": "Renders the hero banner section with a background image, overlay gradient, app branding, tagline, audience badges, and key stats (users, cities, categories).",
  "frontend/src/components/HomeFeedMockup.tsx": "Displays a responsive grid of sample marketplace listing cards with category icons, price, condition badge, and location/distance info.",
  "frontend/src/components/InlineEditField.tsx": "A reusable inline text field that toggles between a read-only display and an editable input with save/cancel controls, supporting async save callbacks.",
  "frontend/src/components/InstallBanner.tsx": "A mobile-only PWA install prompt banner that handles both Android (beforeinstallprompt) and iOS (manual share instructions) install flows, with dismiss persistence via localStorage.",
  "frontend/src/components/JourneyFlow.tsx": "Renders a vertical step-by-step user journey flow with icons, labels, and descriptions, styled with green or secondary color themes based on the flow data.",
  "frontend/src/components/ListingCard.tsx": "Displays a single marketplace listing card with photo or category emoji fallback, price, location, condition badge, and a sponsored indicator for boosted listings.",
  "frontend/src/components/ListingCreationCard.tsx": "Renders a grid of listing creation step cards, each showing a step number, title, and a field mockup UI (upload, dropdown, number input, radio, or location) based on step configuration.",
  "frontend/src/components/LoginPrompt.tsx": "Renders a login prompt UI for Internet Identity authentication, supporting both a compact modal variant and a full-page hero layout with feature benefits and a login button.",
  "frontend/src/components/MessageBubble.tsx": "Displays a single chat message bubble styled differently for sent vs. received messages, with a relative timestamp.",
  "frontend/src/components/MonetizationSection.tsx": "Renders the monetization strategy section, highlighting the primary revenue stream with a boosted listing mockup and listing secondary streams in a grid.",
  "frontend/src/components/MVPPlanSection.tsx": "Displays the MVP plan section with a feature checklist split into 'must-have' and 'nice-to-have' categories, plus an 8-week development timeline using MVPTimeline.",
  "frontend/src/components/MVPTimeline.tsx": "Renders a responsive grid of weekly milestone cards, each showing tasks with color-coded styling based on the week index.",
  "frontend/src/components/MyListingCard.tsx": "Displays a compact card for a user's own listing with thumbnail, status badge, price, and action buttons for editing, boosting, and deleting (with confirmation dialog).",
  "frontend/src/components/NavigationTabs.tsx": "Renders a sticky horizontal tab navigation bar for switching between blueprint sections, highlighting the active tab with a primary color indicator.",
  "frontend/src/components/PatternDivider.tsx": "A simple presentational component that renders a decorative kente-pattern horizontal divider, with an optional thin variant.",
  "frontend/src/components/PaymentMethodsMockup.tsx": "Renders a payment methods UI mockup showing selectable payment options with icons and availability badges, plus transaction status indicators.",
  "frontend/src/components/PhotoCarousel.tsx": "A photo carousel component that displays a list of ExternalBlob images with prev/next navigation, dot indicators, and a fullscreen overlay mode.",
  "frontend/src/components/PhotoUpload.tsx": "A photo upload component that allows users to select and preview up to a configurable maximum number of images, storing them as ExternalBlob objects with remove support.",
  "frontend/src/components/ProfileSetup.tsx": "A profile setup form component that collects a user's name, phone, and location, then saves the profile via a mutation hook with toast feedback.",
  "frontend/src/components/ProfileStatsRow.tsx": "A stats row component displaying listing count, average rating, and review count with animated count-up transitions for a user profile.",
  "frontend/src/components/ProfileTabs.tsx": "A tabbed profile component showing a user's listings, reviews, activity, and followed sellers, with clickable seller cards fetched via query hooks.",
  "frontend/src/components/RecentSearchChips.tsx": "A component that renders recent search terms as dismissible chips with options to select, remove individual terms, or clear all.",
  "frontend/src/components/RegistrationFlowCard.tsx": "A visual card component that renders a multi-step registration flow with icons, field placeholders, and validation state indicators for each step.",
  "frontend/src/components/ReportModal.tsx": "A dialog modal that lets users report another user by selecting a reason from a predefined list, submitting the report via the `useCreateReport` mutation hook.",
  "frontend/src/components/RevenueCard.tsx": "Displays a single revenue stream card with its type badge, description, and projected impact, highlighting primary streams with a special border and badge.",
  "frontend/src/components/ReviewForm.tsx": "A form component for submitting a star rating and optional comment review for a seller, using the `useCreateReview` mutation hook.",
  "frontend/src/components/ReviewsList.tsx": "Fetches and renders a list of reviews for a given user, showing star ratings, timestamps, and comments, with skeleton loading states.",
  "frontend/src/components/RoadmapPhaseCard.tsx": "Renders a single roadmap phase as a timeline card showing the phase number, timeframe, key deliverables, and success metrics with color-coded styling.",
  "frontend/src/components/RoadmapSection.tsx": "A section component that renders all roadmap phases using `RoadmapPhaseCard` components sourced from the roadmap data file.",
  "frontend/src/components/SearchBar.tsx": "A controlled search input with a search icon and a clear button, supporting optional auto-focus behavior.",
  "frontend/src/components/SearchFilterMockup.tsx": "A static UI mockup displaying a search bar with category, price range, and condition filter controls using provided `FilterOptions` data.",
  "frontend/src/components/SectionContainer.tsx": "A reusable layout wrapper for page sections that renders a title, optional subtitle, a decorative divider, and child content.",
  "frontend/src/components/SellerInfo.tsx": "Displays a clickable seller summary card with avatar initial, name, verified badge, location, and rating, with a skeleton loading state when seller data is absent.",
  "frontend/src/components/SkeletonListingCard.tsx": "A placeholder skeleton component that mimics the layout of a listing card during loading states.",
  "frontend/src/components/StarRating.tsx": "A reusable star rating component supporting interactive selection or read-only display in three sizes.",
  "frontend/src/components/TechStackCard.tsx": "Renders a single tech stack item as a styled card showing its category badge, technology name, and rationale. Uses a color map to apply themed styles based on category color.",
  "frontend/src/components/TechStackSection.tsx": "Displays a grid of TechStackCard components within a SectionContainer, sourcing data from the techStack data file. Includes a subtitle explaining the performance-focused technology choices.",
  "frontend/src/components/TrustSafetyMockup.tsx": "Renders interactive UI mockups for trust and safety mechanisms (rating, review, report, block) based on passed TrustMechanism data. Each mechanism type displays a contextually appropriate visual mockup.",
  "frontend/src/components/UserFlowsSection.tsx": "Displays buyer and seller user journey flows using JourneyFlow components, with a toggle for mobile and a side-by-side grid layout for desktop. Flow data is sourced from the userFlows data file.",
  "frontend/src/components/VerifiedBadgeMockup.tsx": "Shows a two-panel mockup with a verification process stepper and a sample verified seller profile card. Uses status-based icon and color configuration to visualize each verification step's state.",
  "frontend/src/components/ZeroResultsState.tsx": "Displays an empty state UI when a search returns no results, showing the search term and a grid of suggested category buttons. Clicking a category button triggers the onCategoryClick callback.",
  "frontend/src/data/database.ts": "Defines the DatabaseEntity data array describing the app's core database schema including Users, Listings, Messages, and Transactions tables with their fields and relationships.",
  "frontend/src/data/features.ts": "Exports a features array defining the app's core features (e.g., phone registration, listing creation, nearby feed) with detailed UI flow steps, field configurations, and sample data for mockups.",
  "frontend/src/data/futureFeatures.ts": "Defines an array of 12 future feature objects (Phase 2 and 3) for a Gambian marketplace app, including AI recommendations, escrow, multi-language support, and live video selling.",
  "frontend/src/data/index.ts": "Barrel file that re-exports all data arrays from the various data modules for convenient single-import access.",
  "frontend/src/data/monetization.ts": "Defines six revenue stream objects covering boosted listings, seller subscriptions, transaction fees, sponsorships, premium tools, and delivery referrals, with pricing tiers for the primary stream.",
  "frontend/src/data/mvpPlan.ts": "Exports MVP feature priorities (must-have vs. nice-to-have) and an 8-week development timeline with milestones covering auth, listings, chat/payments, and launch.",
  "frontend/src/data/roadmap.ts": "Defines four roadmap phases (Foundation, Growth, Monetization, Scale) spanning 12 months, each with deliverables and measurable success metrics.",
  "frontend/src/data/techStack.ts": "Lists 10 technology choices for the app stack—including React Native, Node.js, PostgreSQL, Socket.io, and Cloudinary—each with a rationale tailored to low-bandwidth Gambian conditions.",
  "frontend/src/data/userFlows.ts": "Defines 7-step buyer and seller journey flows for the marketplace app, describing each step's label, description, and icon.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) actors, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Thin re-export wrapper that exposes the useGetCallerUserProfile query hook from useQueries for convenient importing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state with status tracking across the React component tree.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, listings, messages, reviews, and boost options using the ICP actor.",
  "frontend/src/hooks/useUnreadMessageCount.ts": "Provides a hook that counts unread messages for the current user by comparing message timestamps against localStorage-tracked last-viewed times per conversation.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind, defines West African-themed CSS custom properties for light/dark modes, and adds decorative Kente/Batik pattern utilities and PWA slide-up animation.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/Chat.tsx": "Chat page that displays a list of user conversations with listing and profile data, showing a blurred unauthenticated preview with a login CTA for logged-out users.",
  "frontend/src/pages/CreateListing.tsx": "Form page for creating a new marketplace listing with fields for title, description, category, price, condition, location, and photos, wrapped in an AuthGuard.",
  "frontend/src/pages/EditListing.tsx": "Form page for editing an existing listing, pre-populating fields from fetched listing data and submitting updates via the useUpdateListing mutation.",
  "frontend/src/pages/HomeFeed.tsx": "Main marketplace feed page that displays listings in a grid with search, category filtering, a featured/boosted listings row, and a refresh control. Sorts boosted listings to the top and shows skeleton loaders while fetching.",
  "frontend/src/pages/ListingDetail.tsx": "Detail view for a single listing showing a photo carousel, seller info, price/category badge, and action buttons for messaging, sharing, and reporting. Also renders a review form and reviews list.",
  "frontend/src/pages/MessageThread.tsx": "Chat thread page between a buyer and seller for a specific listing, supporting both authenticated and anonymous (guest) message sending with auto-scroll and a guest name prompt.",
  "frontend/src/pages/Profile.tsx": "Authenticated user profile page with inline-editable name and location fields, stats row, listings tabs, and logout; wraps content in an AuthGuard component.",
  "frontend/src/pages/PublicProfile.tsx": "Read-only public profile page for any user showing their avatar, rating, location, verified badge, reviews list, and a report button for authenticated non-owners.",
  "frontend/src/pages/Search.tsx": "React page component for searching listings with debounced input, recent search history (localStorage), client-side condition/price filters, and infinite-scroll results rendered as ListingCards.",
  "frontend/src/types/blueprint.ts": "TypeScript type definitions for the Gambia Market product blueprint, covering features, user flows, database entities, tech stack items, MVP features, and all sub-types like chat, payments, and trust mechanisms.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Outfit/Inter), OKLCH-based design tokens for colors and shadows, border radius variants, accordion animations, and typography/container-query plugins.",
  "project_state.json": "Project state snapshot (version 15) describing Gambia Market's architecture, MVP scope, known issues, required images, and the full list of existing implemented features for build planning continuity."
}