{
  "backend/main.mo": "Entry point for the Motoko backend actor that composes blob storage functionality via a MixinStorage mixin.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (phone registration, listing creation, home feed, search filters, etc.) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries describing the purpose and content of each frontend source file, serving as documentation for the frontend codebase.",
  "frontend/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the React app with a root div mount point and a module script tag loading the main TSX entry point, titled 'Gambia Market'.",
  "frontend/src/App.tsx": "Root React component that renders the hero section, kente pattern dividers, sticky navigation tabs, and conditionally displays one of eight blueprint sections based on the active tab state, plus a footer.",
  "frontend/src/components/BoostedListingMockup.tsx": "UI component that renders a side-by-side comparison of standard vs. boosted listings and a pricing tiers grid to showcase the Boosted Listings monetization feature.",
  "frontend/src/components/ChatMockup.tsx": "UI component that renders a realistic in-app chat mockup with a listing context header, scrollable message bubbles, and a message input bar using ChatDemo data.",
  "frontend/src/components/DatabaseStructureSection.tsx": "Section component that renders a responsive grid of EntityCard components for each of the six core database entities using static database data.",
  "frontend/src/components/EntityCard.tsx": "Renders a database entity as a card with a header showing name/description, a table of fields with name/type/description columns, and a list of relationships.",
  "frontend/src/components/FeatureBreakdownSection.tsx": "Renders the 'Core Feature Breakdown' section by iterating over features data and conditionally rendering specialized mockup/flow sub-components based on which optional properties each feature has.",
  "frontend/src/components/FeatureCard.tsx": "Displays a single feature as a card with a mapped Lucide icon, category badge with color coding, title, and description.",
  "frontend/src/components/FulfillmentOptionsCard.tsx": "Renders a two-column grid of fulfillment option cards (delivery vs. meet-up), each showing an icon, title, description, and sample form fields.",
  "frontend/src/components/FutureFeatureCard.tsx": "Displays a single future feature card with its title, description, and a phase badge (Phase 2 or Phase 3) styled with distinct colors.",
  "frontend/src/components/FutureFeaturesSection.tsx": "Renders the 'Future Features' section by splitting features into Phase 2 and Phase 3 groups, each displayed in a labeled responsive grid of FutureFeatureCards.",
  "frontend/src/components/HeroSection.tsx": "Renders the hero banner with a background image, overlay gradient, app branding, tagline, audience badges, and key stats (target users, cities, categories).",
  "frontend/src/components/HomeFeedMockup.tsx": "Displays a responsive grid of sample marketplace listing cards, each showing a category icon placeholder, title, price in Dalasi, location, and distance.",
  "frontend/src/components/JourneyFlow.tsx": "Renders a vertical step-by-step user journey flow with numbered steps, connecting lines, icons, and descriptions, styled in either green or secondary color themes.",
  "frontend/src/components/ListingCreationCard.tsx": "Renders a grid of listing creation step cards, each displaying a step number, title, icon, and a field mockup (upload, dropdown, number, radio, or location) based on the step's fieldType.",
  "frontend/src/components/MonetizationSection.tsx": "Displays the monetization strategy section, highlighting the primary revenue stream with a BoostedListingMockup and listing secondary streams in a responsive grid of RevenueCards.",
  "frontend/src/components/MVPPlanSection.tsx": "Displays the MVP plan section with a two-column feature checklist split into 'must-have' and 'nice-to-have' items, followed by an 8-week development timeline using MVPTimeline.",
  "frontend/src/components/MVPTimeline.tsx": "Renders a color-coded grid of MVP timeline week cards, each showing a week range, milestone title, and a list of tasks with check icons.",
  "frontend/src/components/NavigationTabs.tsx": "Sticky horizontal navigation bar with eight labeled emoji tabs; highlights the active tab and calls onTabChange when a tab is clicked.",
  "frontend/src/components/PatternDivider.tsx": "Simple presentational divider component that applies a kente-pattern CSS class (normal or thin variant) as a decorative horizontal separator.",
  "frontend/src/components/PaymentMethodsMockup.tsx": "Renders a payment UI mockup showing an illustration, a selectable list of payment method cards with icons and availability badges, and transaction status badge chips.",
  "frontend/src/components/RegistrationFlowCard.tsx": "Renders a vertical stepped registration flow with connector lines between steps, each card showing an icon, step title, and input fields with validation state icons.",
  "frontend/src/components/RevenueCard.tsx": "Displays a single revenue stream card with a title, revenue type badge, description, and projected impact; primary streams receive a highlighted border and a 'Primary Revenue' badge.",
  "frontend/src/components/RoadmapPhaseCard.tsx": "Renders a single roadmap phase as a timeline card with phase number, timeframe, deliverables, and success metrics. Uses color cycling based on phase index.",
  "frontend/src/components/RoadmapSection.tsx": "Section component that renders all roadmap phases using RoadmapPhaseCard, sourcing data from the roadmap data file.",
  "frontend/src/components/SearchFilterMockup.tsx": "UI mockup of a search and filter panel with a search bar, category chips, price range inputs, and condition checkboxes driven by FilterOptions props.",
  "frontend/src/components/SectionContainer.tsx": "Reusable layout wrapper for page sections that renders a title, optional subtitle, a decorative divider, and child content with consistent padding and max-width.",
  "frontend/src/components/TechStackCard.tsx": "Displays a single tech stack item card with a color-coded category badge, technology name, and rationale description.",
  "frontend/src/components/TechStackSection.tsx": "Section component that renders a responsive grid of TechStackCards sourced from the techStack data file.",
  "frontend/src/components/TrustSafetyMockup.tsx": "Renders a grid of trust and safety mechanism cards (rating, review, report, block) with interactive mockup UI elements specific to each mechanism type.",
  "frontend/src/components/UserFlowsSection.tsx": "Section displaying buyer and seller user journey flows side-by-side on desktop and as a toggled single view on mobile.",
  "frontend/src/components/VerifiedBadgeMockup.tsx": "Displays a two-panel mockup showing a verification process stepper with status indicators and a sample verified seller profile card with badge.",
  "frontend/src/data/database.ts": "Defines the database schema as an array of DatabaseEntity objects covering Users, Listings, Messages, and Transactions tables with fields and relationships.",
  "frontend/src/data/features.ts": "Defines the core feature list for the Gambia Market app, including detailed flow steps, creation steps, and sample data for features like phone registration, listing creation, and nearby feed.",
  "frontend/src/data/futureFeatures.ts": "Exports an array of planned future features (Phases 2–3) such as AI recommendations, escrow payments, voice search, and multi-language support.",
  "frontend/src/data/index.ts": "Barrel file that re-exports all data modules (features, userFlows, database, techStack, mvpPlan, futureFeatures, monetization, roadmap) from a single entry point.",
  "frontend/src/data/monetization.ts": "Defines the app's revenue streams including boosted listings, seller subscriptions, transaction fees, and delivery referrals, with pricing tiers for the primary revenue driver.",
  "frontend/src/data/mvpPlan.ts": "Exports the MVP feature list with must-have/nice-to-have priorities and an 8-week development timeline broken into four milestone sprints.",
  "frontend/src/data/roadmap.ts": "Defines four roadmap phases (Foundation, Growth, Monetization, Scale) spanning 12 months, each with deliverables and measurable success metrics.",
  "frontend/src/data/techStack.ts": "Lists the chosen technologies for the app (React Native, Node.js, PostgreSQL, Socket.io, etc.) with rationale for each selection, particularly around low-bandwidth and low-end device constraints.",
  "frontend/src/data/userFlows.ts": "Defines step-by-step buyer and seller journey flows, each with labels, descriptions, and icon names for UI rendering.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using the user's Internet Identity, returning an anonymous actor when unauthenticated and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Computer Internet Identity authentication, managing login/logout state, AuthClient creation, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file reserved for future backend query hooks; currently exports nothing.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind, defining a West African-inspired OKLCH color palette for light/dark modes, and adding kente-pattern and batik-bg decorative utility classes.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/blueprint.ts": "TypeScript type definitions for all blueprint sections of the Gambia Market app, including features, user flows, database entities, tech stack items, MVP plan, and monetization/roadmap structures.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based semantic color tokens, brand colors, custom shadows, border radii, and accordion animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state (version 5) for Gambia Market, including architectural notes, MVP scope, existing implemented features, and image requirements for the blueprint SPA."
}