{
  "backend/main.mo": "Main Motoko actor for the Gambia Market backend, defining data types (UserProfile, Listing, Message, Transaction, Review, Report) and state maps, with mixins for blob storage and authorization.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering components, data files, types, and hooks for the Gambia Market blueprint UI.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme tokens including colors, borders, and chart variables.",
  "frontend/index.html": "HTML entry point for the Gambia Market PWA, including manifest link, iOS/Android PWA meta tags, theme color, and the React root div.",
  "frontend/public/manifest.json": "PWA web app manifest for Gambia Market defining app name, display mode, theme colors, and two icon sizes (192x192 and 512x512).",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy for GET requests, caching the app shell on install and cleaning old caches on activate.",
  "frontend/src/App.tsx": "Root React component managing page navigation state, tab switching, authentication logout, and rendering all top-level pages with AppHeader, BottomNav, InstallBanner, and Toaster.",
  "frontend/src/components/AppHeader.tsx": "Sticky header component displaying the Gambia Market logo, a decorative kente accent line, and search/profile icon buttons.",
  "frontend/src/components/AuthGuard.tsx": "Authentication guard component that shows a loading spinner, LoginPrompt, or ProfileSetup based on identity and profile state, otherwise renders children.",
  "frontend/src/components/BoostedListingMockup.tsx": "A visual mockup component showing a side-by-side comparison of standard vs. boosted listings, along with a primary revenue driver banner and pricing tiers display.",
  "frontend/src/components/BoostModal.tsx": "A dialog modal that displays available boost options for a listing, allowing users to select a duration/price tier to promote their listing to the top of the feed.",
  "frontend/src/components/BottomNav.tsx": "A fixed bottom navigation bar with five tabs (Home, Search, Sell, Chat, Profile) that shows an unread message badge on the Chat tab for authenticated users.",
  "frontend/src/components/CategoryFilter.tsx": "A horizontally scrollable category filter bar with emoji icons and listing counts, allowing users to filter listings by category.",
  "frontend/src/components/ChatMockup.tsx": "A static UI mockup of a chat interface showing a listing context header, sample messages, and an input bar for blueprint/demo purposes.",
  "frontend/src/components/ConversationItem.tsx": "A button-style list item representing a conversation, displaying the other user's name, listing thumbnail, last message preview, and relative timestamp.",
  "frontend/src/components/DatabaseStructureSection.tsx": "A section component that renders a grid of EntityCard components for all database entities defined in the database data file.",
  "frontend/src/components/EditProfileForm.tsx": "A form component for editing a user's name and location, with validation and submission handled via the updateUser mutation hook.",
  "frontend/src/components/EntityCard.tsx": "A card component that displays a database entity's name, description, fields table (with name, type, and description columns), and its relationships.",
  "frontend/src/components/FeatureBreakdownSection.tsx": "Renders the 'Core Feature Breakdown' section by iterating over features data and conditionally displaying various mockup/card sub-components based on each feature's properties.",
  "frontend/src/components/FeatureCard.tsx": "Displays a single feature's icon, category badge, title, and description in a styled card, mapping feature data to Lucide icons and category-specific colors.",
  "frontend/src/components/FeaturedListingsRow.tsx": "Renders a horizontally scrollable row of featured marketplace listings, each showing a photo or category emoji, title, price, and location.",
  "frontend/src/components/FulfillmentOptionsCard.tsx": "Displays a grid of fulfillment options (delivery or meet-up) with icons, descriptions, and sample form fields, styled differently based on option type.",
  "frontend/src/components/FutureFeatureCard.tsx": "Renders a single future feature card showing its title, description, and a phase badge (Phase 2 or Phase 3) with phase-specific styling.",
  "frontend/src/components/FutureFeaturesSection.tsx": "Displays the 'Future Features' section by splitting features into Phase 2 and Phase 3 groups and rendering them in labeled grids of FutureFeatureCard components.",
  "frontend/src/components/GuestNamePrompt.tsx": "A dialog that prompts unauthenticated users to enter a display name before messaging a seller, with an alternative option to log in via Internet Identity.",
  "frontend/src/components/HeroSection.tsx": "Renders the landing page hero banner with a background image, app branding, tagline, audience badges, and key stats for Gambia Market.",
  "frontend/src/components/HomeFeedMockup.tsx": "Displays a grid mockup of sample marketplace listings with category icons, condition badges, price, and location for the home feed feature preview.",
  "frontend/src/components/InlineEditField.tsx": "A reusable inline edit component that toggles between a display view and an input field with save/cancel buttons, supporting async save callbacks and keyboard shortcuts.",
  "frontend/src/components/InstallBanner.tsx": "A mobile-only PWA install banner that handles both Android (beforeinstallprompt) and iOS (manual share instructions) install flows, with a dismiss-once localStorage flag.",
  "frontend/src/components/JourneyFlow.tsx": "Renders a vertical step-by-step user journey flow with icons, numbered steps, and connecting lines, styled in green or secondary color based on the flow's color property.",
  "frontend/src/components/ListingCard.tsx": "Displays a marketplace listing as a card with photo, title, price, location, condition badge, and a sponsored indicator for boosted listings.",
  "frontend/src/components/ListingCreationCard.tsx": "Renders a grid of listing creation step cards, each showing a step number, title, and a field mockup UI (upload, dropdown, number, radio, or location) based on the step's field type.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a login prompt in either compact or full-page mode, showcasing app benefits and triggering Internet Identity authentication via a login button.",
  "frontend/src/components/MessageBubble.tsx": "Displays a single chat message bubble styled differently for sent vs. received messages, with a relative timestamp.",
  "frontend/src/components/MonetizationSection.tsx": "Renders the monetization strategy section, separating primary and secondary revenue streams into distinct styled layouts using RevenueCard and BoostedListingMockup components.",
  "frontend/src/components/MVPPlanSection.tsx": "Renders the MVP plan section with a must-have vs. nice-to-have feature checklist and an 8-week development timeline using MVPTimeline component.",
  "frontend/src/components/MVPTimeline.tsx": "Renders a responsive grid of MVP timeline week cards, each showing a milestone and checklist of tasks with color-coded styling.",
  "frontend/src/components/MyListingCard.tsx": "Displays a compact card for a user's own listing with thumbnail, status badge, price, and action buttons for editing, boosting, and deleting, including confirmation dialogs.",
  "frontend/src/components/NavigationTabs.tsx": "Renders a sticky horizontal tab navigation bar with emoji-labeled tabs for switching between blueprint sections.",
  "frontend/src/components/PatternDivider.tsx": "A simple decorative divider component that applies a kente pattern CSS class, with an optional thin variant.",
  "frontend/src/components/PaymentMethodsMockup.tsx": "Displays a mockup UI for selecting payment methods and viewing transaction status badges, using data-driven props for methods and states.",
  "frontend/src/components/PhotoCarousel.tsx": "An image carousel component for listing photos with previous/next navigation, dot indicators, and a fullscreen overlay view.",
  "frontend/src/components/PhotoUpload.tsx": "Handles photo selection and preview for listings, allowing users to add up to a configurable maximum number of photos with remove functionality.",
  "frontend/src/components/ProfileSetup.tsx": "A form component for new users to enter their name, phone, and location to create a profile, using the `useSaveCallerUserProfile` mutation and displaying toast notifications on success or failure.",
  "frontend/src/components/ProfileStatsRow.tsx": "Displays a horizontal stats bar showing a user's listing count, average rating, and review count with animated count-up transitions.",
  "frontend/src/components/ProfileTabs.tsx": "Renders a tabbed profile view with tabs for listings, reviews, activity, and a following list that fetches and displays followed sellers with their profile details.",
  "frontend/src/components/RecentSearchChips.tsx": "Renders a list of recent search terms as dismissible chips with options to select, remove individual terms, or clear all.",
  "frontend/src/components/RegistrationFlowCard.tsx": "Displays a multi-step registration flow as a series of connected cards, each showing step fields with their placeholders and validation state icons.",
  "frontend/src/components/ReportModal.tsx": "A dialog modal that allows users to report another user by selecting a reason from a dropdown, submitting via the `useCreateReport` mutation.",
  "frontend/src/components/RevenueCard.tsx": "Displays a single revenue stream card with its type badge, description, and projected impact, highlighting primary revenue streams with a special border and label.",
  "frontend/src/components/ReviewForm.tsx": "A form for submitting a star rating and optional comment review for a seller, using the `useCreateReview` mutation with toast feedback.",
  "frontend/src/components/ReviewsList.tsx": "Fetches and displays a list of reviews for a given user, showing star ratings, comments, and relative timestamps, with loading skeletons and an empty state.",
  "frontend/src/components/RoadmapPhaseCard.tsx": "Renders a single roadmap phase as a timeline card with phase number, timeframe, deliverables, and success metrics, using color-coded styles cycling through four theme variants.",
  "frontend/src/components/RoadmapSection.tsx": "Displays the full development roadmap section by mapping over roadmapPhases data and rendering a RoadmapPhaseCard for each phase inside a SectionContainer.",
  "frontend/src/components/SearchBar.tsx": "A controlled search input component with a search icon, optional auto-focus, and a clear button that appears when the input has a value.",
  "frontend/src/components/SearchFilterMockup.tsx": "A static UI mockup showing a search bar with category, price range, and condition filters, using FilterOptions data to render active filter states.",
  "frontend/src/components/SectionContainer.tsx": "A reusable layout wrapper for page sections that renders a heading, optional subtitle, a decorative divider, and slotted children content.",
  "frontend/src/components/SellerInfo.tsx": "Displays a clickable seller profile card with avatar initial, name, verified badge, location, and rating; shows a skeleton loader when seller data is unavailable.",
  "frontend/src/components/SkeletonListingCard.tsx": "A placeholder skeleton component that mimics the layout of a listing card with animated skeleton elements for the image and text fields.",
  "frontend/src/components/StarRating.tsx": "An interactive or read-only star rating component supporting three sizes, with filled/unfilled star states based on the current value.",
  "frontend/src/components/TechStackCard.tsx": "Renders a single tech stack item card displaying its category badge (color-coded), technology name, and rationale description.",
  "frontend/src/components/TechStackSection.tsx": "Displays the recommended tech stack section by rendering a responsive grid of TechStackCard components from the techStackItems data.",
  "frontend/src/components/TrustSafetyMockup.tsx": "Renders a grid of trust and safety mechanism cards (rating, review, report, block) with interactive mockup UI elements specific to each mechanism type.",
  "frontend/src/components/UserFlowsSection.tsx": "Displays buyer and seller user journey flows side-by-side on desktop and as a toggled single view on mobile using JourneyFlow components.",
  "frontend/src/components/VerifiedBadgeMockup.tsx": "Renders a two-panel UI mockup showing a verification process stepper (with step status icons) and a sample verified seller profile card with badge, rating, and stats.",
  "frontend/src/components/ZeroResultsState.tsx": "Displays an empty-state UI when a search returns no results, showing the search term and a grid of suggested category buttons the user can click to browse.",
  "frontend/src/data/database.ts": "Defines the app's database schema as an array of DatabaseEntity objects, covering Users, Listings, Messages, and Transactions tables with fields and relationships.",
  "frontend/src/data/features.ts": "Exports a typed array of core app features (e.g., phone registration, listing creation, nearby feed) each with detailed UI flow steps, field definitions, and sample data.",
  "frontend/src/data/futureFeatures.ts": "Exports a list of planned future features (Phase 2 and 3) such as AI recommendations, escrow payments, voice search, and live video selling, each with a description and phase label.",
  "frontend/src/data/index.ts": "Barrel file that re-exports all data arrays (features, userFlows, database entities, tech stack, MVP plan, future features, monetization, and roadmap) from their respective modules.",
  "frontend/src/data/monetization.ts": "Defines the app's revenue streams as typed objects, including boosted listings with pricing tiers, seller subscriptions, transaction fees, sponsorships, and delivery referrals.",
  "frontend/src/data/mvpPlan.ts": "Exports the MVP feature list with must-have/nice-to-have priorities and an 8-week build timeline broken into four milestone sprints from auth through beta launch.",
  "frontend/src/data/roadmap.ts": "Defines the four-phase product roadmap (Foundation, Growth, Monetization, Scale) as an array of RoadmapPhase objects, each with deliverables and success metrics.",
  "frontend/src/data/techStack.ts": "Exports an array of TechStackItem objects describing the chosen technologies (React Native, Node.js, PostgreSQL, etc.) with rationale tailored to the Gambian market.",
  "frontend/src/data/userFlows.ts": "Defines the step-by-step buyer and seller journey flows as UserFlow arrays, each step containing a label, description, and icon name.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Re-exports the useGetCallerUserProfile hook from useQueries.ts as a convenience wrapper.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the backend actor, covering user profiles, listings (CRUD, search, boost), messages, reviews, and other data-fetching and mutation operations.",
  "frontend/src/hooks/useUnreadMessageCount.ts": "Computes the number of unread messages for the current user by comparing conversation timestamps against localStorage-persisted last-viewed times, and exports a helper to mark conversations as viewed.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind, defines CSS custom properties for a West African Market light/dark theme, and adds decorative utility classes like kente-pattern, kente-divider, and batik-bg.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/Chat.tsx": "Chat page that lists the current user's conversations, showing a blurred preview with a login CTA for unauthenticated users, and rendering ConversationItem components with listing and user data for authenticated users.",
  "frontend/src/pages/CreateListing.tsx": "Form page for creating a new marketplace listing with fields for title, category, price, condition, location, photos, and real-estate-specific fields, wrapped in an AuthGuard.",
  "frontend/src/pages/EditListing.tsx": "Form page for editing an existing listing that pre-populates fields from the fetched listing data and submits updates via the useUpdateListing hook, also wrapped in an AuthGuard.",
  "frontend/src/pages/HomeFeed.tsx": "Main feed page displaying a searchable, filterable grid of listings with boosted listings shown first, a featured row for boosted items, skeleton loading states, and an empty state prompt.",
  "frontend/src/pages/ListingDetail.tsx": "Displays a full listing detail page with photo carousel, seller info, messaging, sharing, reporting, and review functionality. Handles loading/not-found states and restricts actions based on authentication and ownership.",
  "frontend/src/pages/MessageThread.tsx": "Renders a conversation thread for a specific listing between the current user and another user, supporting both authenticated and guest (anonymous) message sending with auto-scroll.",
  "frontend/src/pages/Profile.tsx": "Shows the authenticated user's own profile with inline-editable name and location, stats, listings, and reviews, wrapped in an AuthGuard component.",
  "frontend/src/pages/PublicProfile.tsx": "Displays a read-only public profile for any user by Principal, showing avatar, rating, reviews, and a report option for authenticated non-owners.",
  "frontend/src/pages/Search.tsx": "Provides a search page with debounced query input, recent searches, category chips, client-side condition/price filters, and paginated listing results.",
  "frontend/src/types/blueprint.ts": "Defines all TypeScript interfaces for the Gambia Market blueprint app, covering features, user flows, database entities, tech stack items, MVP planning, and detailed sub-types for registration, listings, chat, payments, and trust/safety mechanisms.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support for values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom brand colors (green, gold, terra, cream, dark), custom fonts (Outfit, Inter), border radii, box shadows, and accordion animations, plus plugins for animate, typography, and container queries.",
  "project_state.json": "Tracks the overall project state for Gambia Market (version 19), including architectural decisions, known issues, existing features, and a summary describing the app as a local marketplace for The Gambia transitioning from blueprint to active development."
}