{
  "backend/main.mo": "Main Motoko actor for Gambia Market defining data types (UserProfile, Listing, Message, Transaction, Review, Report) and state maps, with public functions for user profiles, listings, messaging, transactions, reviews, reports, likes, follows, and blob storage/authorization mixins.",
  "backend/migration.mo": "Migration module that upgrades actor state from OldActor to NewActor by adding `followers` and `profilePicUrl` fields to UserProfile and a `likedBy` set to each Listing.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (like/follow system, profile picture upload, cross-device data access) to their frontend files, component dependencies, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing 1–2 sentence summaries for all frontend source files, covering static data modules, React components, pages, hooks, and configuration files for the Gambia Market blueprint app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme tokens (background, foreground, primary, chart colors, sidebar) used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the Gambia Market React SPA, mounting the app into a `#root` div and loading the TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component managing page routing state (home, sell, chat, profile, listing-detail, message-thread, public-profile, edit-listing) via a `navigate` function, and rendering the appropriate page component along with AppHeader, BottomNav, and Toaster.",
  "frontend/src/components/AppHeader.tsx": "Sticky top navigation bar component displaying the Gambia Market logo/branding, a decorative kente accent strip, and search/profile icon buttons.",
  "frontend/src/components/AuthGuard.tsx": "A route guard component that checks authentication and profile status, rendering a loading spinner, LoginPrompt, ProfileSetup, or children accordingly.",
  "frontend/src/components/BoostedListingMockup.tsx": "A UI mockup component that visually compares a standard listing versus a boosted listing, and displays boost pricing tiers for promotional purposes.",
  "frontend/src/components/BoostModal.tsx": "A dialog modal that displays available boost pricing options for a listing and triggers the boost mutation when a user selects a duration.",
  "frontend/src/components/BottomNav.tsx": "A fixed bottom navigation bar with five tabs (Home, Search, Sell, Chat, Profile) that highlights the active tab and shows an unread message badge on the Chat tab.",
  "frontend/src/components/CategoryFilter.tsx": "A horizontally scrollable filter bar that renders category buttons with emoji icons and optional listing counts, highlighting the currently selected category.",
  "frontend/src/components/ChatMockup.tsx": "A static UI mockup of a chat interface showing a listing context header, sample messages, and a dummy input bar for blueprint/demo purposes.",
  "frontend/src/components/ConversationItem.tsx": "A button-style list item displaying a conversation summary including the other user's name, listing thumbnail, last message preview, and relative timestamp.",
  "frontend/src/components/DatabaseStructureSection.tsx": "A section component that renders a grid of EntityCard components sourced from static database entity data for a blueprint/documentation view.",
  "frontend/src/components/EditProfileForm.tsx": "A form component for editing a user's name and location, submitting updates via the useUpdateUser mutation with loading and error feedback via toasts.",
  "frontend/src/components/EntityCard.tsx": "Renders a database entity as a card with a header showing name/description, a table of fields with types, and a list of relationships.",
  "frontend/src/components/FeatureBreakdownSection.tsx": "Renders the 'Core Feature Breakdown' section by iterating over features data and conditionally rendering specialized mockup/flow sub-components based on each feature's properties.",
  "frontend/src/components/FeatureCard.tsx": "Displays a single feature's icon, category badge, title, and description in a styled card using a mapped icon set and category color scheme.",
  "frontend/src/components/FeaturedListingsRow.tsx": "Horizontally scrollable row of featured marketplace listings, each showing a photo or category emoji, title, price, and location.",
  "frontend/src/components/FulfillmentOptionsCard.tsx": "Renders a grid of fulfillment option cards (delivery or meet-up) with icons, descriptions, and sample form fields.",
  "frontend/src/components/FutureFeatureCard.tsx": "Displays a single future feature card with its title, description, and a phase badge (Phase 2 or Phase 3) with corresponding color styling.",
  "frontend/src/components/FutureFeaturesSection.tsx": "Renders the 'Future Features' section split into Phase 2 and Phase 3 grids of FutureFeatureCard components sourced from static data.",
  "frontend/src/components/GuestNamePrompt.tsx": "Modal dialog that prompts unauthenticated users to enter a guest display name before messaging a seller, with an alternative option to log in via Internet Identity.",
  "frontend/src/components/HeroSection.tsx": "Full-width hero banner with a background image, overlay gradient, app branding, tagline, audience badges, and key stats for the Gambia Market app.",
  "frontend/src/components/HomeFeedMockup.tsx": "Renders a responsive grid of sample listing cards with category icons, price, condition badge, and location info for mockup/blueprint purposes.",
  "frontend/src/components/InlineEditField.tsx": "A reusable inline edit component that toggles between a display view and an input field with save/cancel controls, supporting async save callbacks.",
  "frontend/src/components/JourneyFlow.tsx": "Displays a vertical step-by-step user journey flow with icons, numbered steps, and color theming based on a UserFlow data object.",
  "frontend/src/components/ListingCard.tsx": "A clickable card component displaying a marketplace listing with photo, title, price, location, condition badge, and a sponsored indicator for boosted listings.",
  "frontend/src/components/ListingCreationCard.tsx": "Renders a grid of listing creation step cards, each showing a step title and a field mockup UI (upload, dropdown, number, radio, or location) based on step configuration.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a login prompt UI (compact or full-page) for Internet Identity authentication, including feature benefits and a login button with loading state.",
  "frontend/src/components/MessageBubble.tsx": "Renders a single chat message bubble, aligned left or right based on whether the current user sent it, with relative timestamp display.",
  "frontend/src/components/MonetizationSection.tsx": "Displays a monetization strategy section with a highlighted primary revenue stream and a grid of secondary revenue streams using RevenueCard components.",
  "frontend/src/components/MVPPlanSection.tsx": "Renders the MVP plan section with a must-have/nice-to-have feature checklist and an 8-week development timeline using MVPTimeline.",
  "frontend/src/components/MVPTimeline.tsx": "Displays a color-coded grid of MVP timeline weeks, each showing a milestone and its associated tasks with checkmark icons.",
  "frontend/src/components/MyListingCard.tsx": "Renders a compact card for a user's own listing with thumbnail, status badge, price, and action buttons for editing, boosting, and deleting (with confirmation dialog).",
  "frontend/src/components/NavigationTabs.tsx": "Sticky horizontal tab navigation bar with emoji-labeled tabs for switching between blueprint sections like Features, Database, Roadmap, etc.",
  "frontend/src/components/PatternDivider.tsx": "Simple decorative divider component that applies a kente pattern CSS class, with an optional thin variant.",
  "frontend/src/components/PaymentMethodsMockup.tsx": "UI mockup displaying selectable payment method cards with icons and availability badges, plus transaction status badge indicators.",
  "frontend/src/components/PhotoCarousel.tsx": "Image carousel for listing photos with previous/next navigation, dot indicators, and a fullscreen overlay view.",
  "frontend/src/components/PhotoUpload.tsx": "Photo upload component that allows selecting multiple image files up to a configurable max, showing previews with remove buttons and an upload progress indicator.",
  "frontend/src/components/ProfileSetup.tsx": "Onboarding form for new users to enter their name, phone, and location, submitting via the saveCallerUserProfile mutation with toast feedback.",
  "frontend/src/components/ProfileStatsRow.tsx": "Displays a row of animated profile statistics (listings, average rating, reviews) with count-up animations using icons from lucide-react.",
  "frontend/src/components/ProfileTabs.tsx": "Renders a tabbed profile view with tabs for listings, reviews, activity, and following; the following tab fetches and displays followed sellers with their profile cards.",
  "frontend/src/components/RecentSearchChips.tsx": "Displays a list of recent search terms as removable chips with options to select, remove individual terms, or clear all.",
  "frontend/src/components/RegistrationFlowCard.tsx": "Renders a multi-step registration flow UI with step cards, icons, form fields, and validation state indicators connected by a timeline.",
  "frontend/src/components/ReportModal.tsx": "A dialog modal that allows users to report another user by selecting a reason from a dropdown and submitting via the createReport mutation.",
  "frontend/src/components/RevenueCard.tsx": "Displays a single revenue stream card with its type, description, and projected impact, highlighting primary revenue streams with a special badge.",
  "frontend/src/components/ReviewForm.tsx": "A form component for submitting a star rating and optional comment review for a seller, using the createReview mutation.",
  "frontend/src/components/ReviewsList.tsx": "Fetches and displays a list of reviews for a given user, showing star ratings, timestamps, and comments with loading skeletons.",
  "frontend/src/components/RoadmapPhaseCard.tsx": "Renders a single roadmap phase card in a timeline layout, showing the phase number, timeframe, deliverables, and success metrics.",
  "frontend/src/components/RoadmapSection.tsx": "Renders the full development roadmap section by mapping over roadmap phase data and displaying each as a RoadmapPhaseCard within a SectionContainer.",
  "frontend/src/components/SearchBar.tsx": "A controlled search input component with a search icon, clear button, and optional auto-focus behavior.",
  "frontend/src/components/SearchFilterMockup.tsx": "A static UI mockup displaying a search bar with category, price range, and condition filter controls using provided FilterOptions data.",
  "frontend/src/components/SectionContainer.tsx": "A reusable section wrapper that renders a title, optional subtitle, a decorative divider, and child content with consistent padding and max-width.",
  "frontend/src/components/SellerInfo.tsx": "Displays a clickable seller profile row with avatar, name, verified badge, location, and rating; shows a skeleton loader when seller data is absent.",
  "frontend/src/components/SkeletonListingCard.tsx": "A placeholder skeleton card matching the layout of a listing card, used while listing data is loading.",
  "frontend/src/components/StarRating.tsx": "An interactive or read-only star rating component supporting three sizes and an onChange callback for selecting a 1–5 rating.",
  "frontend/src/components/TechStackCard.tsx": "Renders a single tech stack item card showing its category badge, technology name, and rationale with color-coded styling.",
  "frontend/src/components/TechStackSection.tsx": "Renders the full tech stack section by mapping over techStackItems data and displaying each as a TechStackCard in a responsive grid.",
  "frontend/src/components/TrustSafetyMockup.tsx": "Displays a grid of trust and safety mechanism mockups (rating, review, report, block) with interactive UI previews based on provided TrustMechanism data.",
  "frontend/src/components/UserFlowsSection.tsx": "Shows buyer and seller user journey flows side-by-side on desktop and as a toggled single view on mobile using JourneyFlow components.",
  "frontend/src/components/VerifiedBadgeMockup.tsx": "Renders a two-panel mockup showing a verification process stepper with step statuses and a sample verified seller profile card with badge.",
  "frontend/src/components/ZeroResultsState.tsx": "An empty-state component shown when search returns no results, displaying the search term and a category browsing grid as suggestions.",
  "frontend/src/data/database.ts": "Defines and exports an array of DatabaseEntity objects describing the app's core tables (Users, Listings, Messages, Transactions, Reviews) with their fields, types, and relationships.",
  "frontend/src/data/features.ts": "Defines and exports an array of Feature objects detailing the app's core features (e.g., phone registration, listing creation, nearby feed) including UI flow steps, fields, and sample data.",
  "frontend/src/data/futureFeatures.ts": "Exports an array of FutureFeature objects describing 12 planned post-MVP features (e.g., AI recommendations, escrow, voice search) organized by development phase (Phase 2 or 3).",
  "frontend/src/data/index.ts": "Barrel file that re-exports all data arrays from the other data modules for convenient single-import access.",
  "frontend/src/data/monetization.ts": "Exports an array of RevenueStream objects outlining six monetization strategies (boosted listings, subscriptions, transaction fees, sponsorships, etc.) with pricing tiers and projected impact.",
  "frontend/src/data/mvpPlan.ts": "Exports MVP feature priorities (must-have vs. nice-to-have) and an 8-week development timeline with milestones and tasks for the initial app launch.",
  "frontend/src/data/roadmap.ts": "Exports four RoadmapPhase objects covering a 12-month product roadmap from MVP foundation through growth, monetization, and scaling, each with deliverables and success metrics.",
  "frontend/src/data/techStack.ts": "Exports an array of TechStackItem objects describing the 10 chosen technologies (React Native, Node.js, PostgreSQL, Socket.io, etc.) with rationale tailored to Gambian infrastructure constraints.",
  "frontend/src/data/userFlows.ts": "Defines static data for buyer and seller user journey flows, each containing ordered steps with labels, descriptions, and icon names for the Gambia Market app.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Re-exports the `useGetCallerUserProfile` query hook from `useQueries.ts` as a convenience alias.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` and `useInternetIdentity` hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the backend, covering user profiles, listings, messages, reviews, and mutations like creating listings and sending messages.",
  "frontend/src/hooks/useUnreadMessageCount.ts": "Hook that computes the number of unread messages for the current user by comparing message timestamps against localStorage-persisted last-viewed times per conversation.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind, imports fonts, defines CSS custom properties for a West African-inspired light/dark color palette, and adds decorative utility classes like kente-pattern and batik-bg.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/src/pages/Chat.tsx": "Chat page component that lists the current user's conversations with per-conversation listing and user data, and shows a blurred unauthenticated preview with a login prompt for logged-out users.",
  "frontend/src/pages/CreateListing.tsx": "Page component with a form for creating a new marketplace listing, including fields for title, description, category, price, condition, location, and photo upload with validation and toast notifications.",
  "frontend/src/pages/EditListing.tsx": "Page component for editing an existing listing, pre-populating form fields from fetched listing data and submitting updates via the useUpdateListing mutation.",
  "frontend/src/pages/HomeFeed.tsx": "Main feed page displaying listings in a two-column grid with search, category filtering, boosted/featured listings row, and a refresh control.",
  "frontend/src/pages/ListingDetail.tsx": "Detail view for a single listing showing a photo carousel, seller info, price/condition/category badges, and actions for messaging the seller, sharing, and reporting.",
  "frontend/src/pages/MessageThread.tsx": "Messaging page that displays a conversation thread for a specific listing, supporting both authenticated and anonymous (guest) message sending with auto-scroll.",
  "frontend/src/pages/Profile.tsx": "Authenticated user profile page that displays and allows inline editing of name and location, shows stats, listings, and reviews, and supports logout and profile sharing.",
  "frontend/src/pages/PublicProfile.tsx": "Read-only public profile page for a given user Principal, showing their info, average rating, reviews, and a report button for authenticated non-owners.",
  "frontend/src/pages/Search.tsx": "Search page with debounced query input, recent searches stored in localStorage, client-side condition/price filters, and a results grid using listing cards.",
  "frontend/src/types/blueprint.ts": "TypeScript type definitions for the app blueprint/spec, covering features, user flows, database entities, tech stack items, and MVP planning structures.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both regular and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens (brand, semantic, chart, sidebar), border radii, box shadows, and accordion animations.",
  "project_state.json": "Tracks the overall state of the Gambia Market project including architecture notes, known issues, existing features, and requirements. Serves as the central planning document recording progress from blueprint phase to active app development."
}