{
  "backend/main.mo": "Main Motoko actor for the Gambia Market backend, defining data types (listings, users, messages, transactions, reviews, reports) and state maps, with mixins for blob storage and authorization.",
  "backend/migration.mo": "Migration module that transforms old user profiles (with profilePicUrl text field) to new user profiles (with profilePic ExternalBlob field), setting profilePic to null for all existing users.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (listing creation flow, profile dashboard, my listings section, etc.) to their relevant frontend files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing the purpose and key contents of each component, page, hook, and data file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the Gambia Market PWA, including manifest link, theme color meta tags, iOS/Android PWA support meta tags, and the React root div.",
  "frontend/public/manifest.json": "PWA web app manifest for Gambia Market defining app name, display mode, theme colors, orientation, and two icon sizes (192x192 and 512x512).",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy for GET requests, caching the app shell on install, cleaning old caches on activate, and falling back to index.html for navigation requests.",
  "frontend/src/App.tsx": "Root React component managing client-side page routing via state, rendering all pages (HomeFeed, Search, CreateListing, EditListing, ListingDetail, Profile, Chat, etc.) and wiring navigation handlers between them.",
  "frontend/src/components/AppHeader.tsx": "Sticky top navigation header with logo, search button, sell button, and login/profile actions using Internet Identity authentication and user profile data.",
  "frontend/src/components/AuthGuard.tsx": "Wraps children with authentication and profile checks, showing loading states, a login prompt, or profile setup flow as needed before rendering protected content.",
  "frontend/src/components/BoostedListingMockup.tsx": "Visual mockup component comparing a standard listing versus a boosted/sponsored listing, along with pricing tiers, used for illustrative/marketing purposes.",
  "frontend/src/components/BoostModal.tsx": "Modal dialog for selecting and purchasing a listing boost option, displaying available duration/price tiers fetched from the backend and submitting via mutation.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with Home, Search, Sell, Chat, and Profile tabs, including an unread message badge count derived from conversations.",
  "frontend/src/components/CategoryFilter.tsx": "Horizontally scrollable category filter bar that lets users select or clear a listing category using emoji-labeled buttons.",
  "frontend/src/components/ChatMockup.tsx": "Static UI mockup of a chat interface showing a listing context header, sample messages, and an input bar, used for demonstration purposes.",
  "frontend/src/components/ConversationItem.tsx": "Renders a single conversation list item showing the other user's avatar, name, last message, and timestamp, with an unread indicator dot and relative time formatting.",
  "frontend/src/components/DatabaseStructureSection.tsx": "Displays the 'Database Structure' section of a blueprint page by rendering a grid of EntityCard components sourced from the database data file.",
  "frontend/src/components/EditProfileForm.tsx": "A controlled form component for editing a user's display name, phone number, and location, with validation and submission via the useUpdateProfile mutation hook.",
  "frontend/src/components/EntityCard.tsx": "Renders a database entity as a card with a header, a fields table showing name/type/description, and an optional relationships section.",
  "frontend/src/components/FeatureBreakdownSection.tsx": "Renders the 'Core Feature Breakdown' section by iterating over features data and conditionally rendering various mockup sub-components based on each feature's properties.",
  "frontend/src/components/FeatureCard.tsx": "Displays a single feature card with a mapped icon, category badge, title, and description for use in the feature breakdown section.",
  "frontend/src/components/FeaturedListingsRow.tsx": "Renders a horizontally scrollable row of featured/boosted listings with photos, prices, and category emojis, each clickable to navigate to a listing detail.",
  "frontend/src/components/FulfillmentOptionsCard.tsx": "Displays a grid of fulfillment options (delivery vs. meet-up) as styled cards with icons, descriptions, and sample form fields.",
  "frontend/src/components/FutureFeatureCard.tsx": "Renders a single future feature card showing its title, description, and a phase badge (Phase 2 or Phase 3) with corresponding color styling.",
  "frontend/src/components/FutureFeaturesSection.tsx": "Displays the 'Future Features' section split into Phase 2 and Phase 3 groups, each rendered as a grid of FutureFeatureCard components.",
  "frontend/src/components/GuestNamePrompt.tsx": "Modal dialog that prompts unauthenticated users to enter a display name before sending a message, with an alternative option to sign in via Internet Identity.",
  "frontend/src/components/HeroSection.tsx": "Hero banner section with a background image, tagline, and CTA buttons for selling or browsing listings, plus static marketplace stats.",
  "frontend/src/components/HomeFeedMockup.tsx": "Renders a responsive grid of sample listing cards with category icons, price, condition badge, and location using mock SampleListing data.",
  "frontend/src/components/InlineEditField.tsx": "Inline editable field component that toggles between display and input modes, calling an async onSave callback with save/cancel controls.",
  "frontend/src/components/InstallBanner.tsx": "PWA install prompt banner that handles both Android (beforeinstallprompt) and iOS (manual instructions) install flows, with dismissal persisted to localStorage.",
  "frontend/src/components/JourneyFlow.tsx": "Renders a vertical step-by-step user journey flow with icons, numbered steps, and color theming based on the flow's color property.",
  "frontend/src/components/ListingCard.tsx": "Clickable card component displaying a marketplace listing with photo or emoji placeholder, price, condition, location, and featured/status badges.",
  "frontend/src/components/ListingCreationCard.tsx": "Renders a grid of listing creation step cards, each displaying a step number, title, icon, and a field mockup (upload, dropdown, number, radio, or location) based on the step's fieldType.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a login prompt UI in either fullpage or inline/card variants, triggering Internet Identity authentication via the useInternetIdentity hook.",
  "frontend/src/components/MessageBubble.tsx": "Renders a single chat message bubble with sent/received styling, inline edit and delete actions, and displays a 'Message deleted' placeholder for deleted messages.",
  "frontend/src/components/MonetizationSection.tsx": "Renders the monetization strategy section, highlighting the primary revenue stream with a boosted listing mockup and listing secondary streams in a grid of RevenueCards.",
  "frontend/src/components/MVPPlanSection.tsx": "Renders the MVP plan section with a must-have/nice-to-have feature checklist and an 8-week development timeline using MVPTimeline.",
  "frontend/src/components/MVPTimeline.tsx": "Displays a responsive grid of weekly milestone cards, each showing a week label, milestone title, and task checklist with rotating color themes.",
  "frontend/src/components/MyListingCard.tsx": "Displays a compact card for a user's own listing with thumbnail, title, price, status badge, boost indicator, and action buttons for view, edit, boost, and delete.",
  "frontend/src/components/NavigationTabs.tsx": "Renders a sticky horizontal navigation bar with emoji-labeled tabs for switching between blueprint sections like Features, Database, and Roadmap.",
  "frontend/src/components/PatternDivider.tsx": "A simple decorative divider component that applies a kente pattern CSS class, with an optional thin variant.",
  "frontend/src/components/PaymentMethodsMockup.tsx": "Displays a mockup UI showing selectable payment method cards and transaction status badges, driven by PaymentMethod and TransactionState props.",
  "frontend/src/components/PhotoCarousel.tsx": "An image carousel component supporting navigation arrows, dot indicators, a photo counter, and a fullscreen overlay for a list of ExternalBlob photos.",
  "frontend/src/components/PhotoUpload.tsx": "Handles photo uploads up to a configurable maximum, displaying thumbnails with remove buttons and an add-photo trigger backed by ExternalBlob.",
  "frontend/src/components/ProfileSetup.tsx": "A modal form for first-time profile setup that collects name, phone, and location, then saves the data via the useSaveCallerUserProfile hook.",
  "frontend/src/components/ProfileStatsRow.tsx": "Displays a four-column stats row (listings, rating, reviews, followers) with animated count-up numbers on mount.",
  "frontend/src/components/ProfileTabs.tsx": "Renders a two-tab panel showing the user's listings (with create/edit/delete actions) and their reviews, including a delete confirmation dialog.",
  "frontend/src/components/RecentSearchChips.tsx": "Renders a list of recent search terms as dismissible chips with options to click a search, remove individual entries, or clear all.",
  "frontend/src/components/RegistrationFlowCard.tsx": "Displays a multi-step registration flow as a vertical timeline of cards, each showing step fields with their placeholders and validation state icons.",
  "frontend/src/components/ReportModal.tsx": "Modal dialog that lets a user select a reason and submit a report against a listing, using the useCreateReport mutation hook.",
  "frontend/src/components/RevenueCard.tsx": "Displays a single revenue stream card with its type badge, description, and projected impact, highlighting primary streams with a special border and badge.",
  "frontend/src/components/ReviewForm.tsx": "Form component for submitting a star rating and optional comment review for a user/listing, using the useCreateReview mutation hook.",
  "frontend/src/components/ReviewsList.tsx": "Fetches and renders a list of reviews for a given user, showing reviewer avatar, star rating, comment, and relative timestamp, with loading skeletons and an empty state.",
  "frontend/src/components/RoadmapPhaseCard.tsx": "Renders a single roadmap phase as a timeline card showing the phase number, timeframe, key deliverables, and success metrics with color-coded styling per phase.",
  "frontend/src/components/RoadmapSection.tsx": "Section component that renders all roadmap phases by mapping over static roadmapPhases data and rendering a RoadmapPhaseCard for each.",
  "frontend/src/components/SearchBar.tsx": "Controlled search input with a search icon, Enter-key submit support, and a clear button that appears when the field has a value.",
  "frontend/src/components/SearchFilterMockup.tsx": "Renders a static UI mockup of a search bar with category, price range, and condition filters using provided FilterOptions data.",
  "frontend/src/components/SectionContainer.tsx": "A reusable layout wrapper that renders a titled section with an optional subtitle and decorative underline, constraining content to a max-width centered container.",
  "frontend/src/components/SellerInfo.tsx": "Displays a clickable seller profile card showing avatar, name, verification badge, location, average rating, and follower count fetched via query hooks.",
  "frontend/src/components/SkeletonListingCard.tsx": "A shimmer placeholder card that mimics the layout of a listing card while content is loading.",
  "frontend/src/components/StarRating.tsx": "An interactive or read-only star rating component supporting hover effects and three size variants.",
  "frontend/src/components/TechStackCard.tsx": "Displays a single tech stack item card with a color-coded category badge, technology name, and rationale text.",
  "frontend/src/components/TechStackSection.tsx": "Renders a grid of TechStackCard components inside a SectionContainer using static techStackItems data.",
  "frontend/src/components/TrustSafetyMockup.tsx": "Renders a grid of trust and safety mechanism cards (rating, review, report, block) with type-specific interactive mockup UI for each.",
  "frontend/src/components/UserFlowsSection.tsx": "Displays buyer and seller user journey flows side-by-side on desktop and as a toggled single view on mobile using JourneyFlow components.",
  "frontend/src/components/VerifiedBadgeMockup.tsx": "Shows a two-panel mockup with a verification process stepper and a sample verified seller profile card including badge image.",
  "frontend/src/components/ZeroResultsState.tsx": "Displays an empty-state UI when a search returns no results, with a clear-search button and optional suggested category chips.",
  "frontend/src/contexts/ThemeContext.tsx": "Provides a React context for light/dark theme management, persisting the user's preference to localStorage and syncing with the system color scheme preference.",
  "frontend/src/data/database.ts": "Defines static data for the app's database schema, describing entities (Users, Listings, Messages, Transactions) with their fields, types, and relationships.",
  "frontend/src/data/features.ts": "Contains static data describing core app features (e.g., phone registration, listing creation, nearby feed) including UI flow steps, fields, and sample listings.",
  "frontend/src/data/futureFeatures.ts": "Defines a list of planned future features (e.g., AI recommendations, escrow, voice search) organized by development phase (Phase 2 or 3).",
  "frontend/src/data/index.ts": "Barrel file that re-exports all data modules (features, userFlows, database, techStack, mvpPlan, futureFeatures, monetization, roadmap) from a single entry point.",
  "frontend/src/data/monetization.ts": "Defines revenue stream data including boosted listings, seller subscriptions, transaction fees, and sponsorships, with pricing tiers and projected impact descriptions.",
  "frontend/src/data/mvpPlan.ts": "Specifies the MVP feature list with priorities (must-have vs. nice-to-have) and an 8-week development timeline broken into four milestone phases.",
  "frontend/src/data/roadmap.ts": "Defines a four-phase product roadmap (Foundation through Scale) spanning 12 months, each with deliverables and measurable success metrics.",
  "frontend/src/data/techStack.ts": "Defines and exports an array of tech stack items for the Gambia Market app, each describing a technology category, choice, and rationale tailored for low-bandwidth and local payment constraints.",
  "frontend/src/data/userFlows.ts": "Defines and exports buyer and seller user journey flows, each as a sequence of labeled steps with icons and descriptions for the Gambia Market app.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Re-exports the useGetCallerUserProfile hook from useQueries as a convenience alias.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the app, covering user profiles, listings, reviews, and messaging with associated mutations and cache invalidation logic.",
  "frontend/src/hooks/useUnreadMessageCount.ts": "Provides a hook to compute the number of unread messages for the current user by comparing conversation timestamps against localStorage-persisted last-viewed times.",
  "frontend/src/index.css": "Defines global CSS custom properties for the Sunrise Market design system (light and dark themes), imports fonts, and adds Tailwind utility classes including gradients and animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/Chat.tsx": "Displays a list of the authenticated user's conversations, grouped by unique user-listing pairs and sorted by most recent message. Shows a login prompt if unauthenticated, loading skeletons while fetching, or an empty state if no conversations exist.",
  "frontend/src/pages/CreateListing.tsx": "Form page for creating a new marketplace listing with fields for title, description, category, price, condition, location, and photos, including real-estate-specific fields. Validates input, calls the createListing mutation, and redirects on success or shows a login prompt if unauthenticated.",
  "frontend/src/pages/EditListing.tsx": "Form page for editing an existing listing, pre-populating fields from the fetched listing data and submitting updates via the updateListing mutation. Supports all listing fields including real-estate subcategory options, and shows a login prompt if unauthenticated.",
  "frontend/src/pages/HomeFeed.tsx": "Main home page displaying a hero section, a featured/boosted listings row, a category filter, and a responsive grid of active listings. Filters listings by selected category and shows skeleton cards while loading.",
  "frontend/src/pages/ListingDetail.tsx": "Detail page for a single listing showing a photo carousel, title, price, metadata, seller info, reviews, and a message/report action bar. Distinguishes between the listing owner and other users to conditionally render actions.",
  "frontend/src/pages/MessageThread.tsx": "Real-time message thread page between the current user and another user for a specific listing, supporting both authenticated and anonymous (guest name) message sending. Auto-scrolls to the latest message and shows a guest name prompt when an unauthenticated user tries to send.",
  "frontend/src/pages/Profile.tsx": "Displays the authenticated user's profile page with avatar upload, stats, reviews, and listings, showing login prompt or profile setup if needed.",
  "frontend/src/pages/PublicProfile.tsx": "Renders a public-facing profile page for a given user Principal, showing their info, active listings, and reviews.",
  "frontend/src/pages/Search.tsx": "Search page with a search bar, recent searches stored in localStorage, popular category chips, and a results list of matching listings.",
  "frontend/src/types/blueprint.ts": "TypeScript type definitions for the app blueprint, covering features, user flows, database entities, tech stack items, and MVP planning structures.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Sora, Plus Jakarta Sans), CSS-variable-based color tokens, border radii, box shadows, keyframe animations, and plugins including tailwindcss-animate.",
  "project_state.json": "Project state manifest (version 3) describing a listings/marketplace app, tracking existing features, known issues (broken listing creation), and requirements for profile, listings management, and reviews pages."
}