{
  "kind": "build_request",
  "title": "Post-logout redirect, social login, seller profiles, likes/follows, profile pictures, cross-device persistence",
  "projectName": "Gambia Market",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-44",
      "text": "After a user logs out from any page, immediately redirect them to the main Home Feed page. The logout action in Profile.tsx and any other location that calls the logout function must navigate to the home route after the identity session is cleared.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make sure anytime time a user logout let his it be redirected to the main home page"
        ]
      },
      "acceptanceCriteria": [
        "Clicking logout on the Profile page navigates the user to the Home Feed ('/') immediately after session is cleared.",
        "The bottom navigation and header reflect the logged-out state on arrival at the home page.",
        "No residual authenticated state remains after logout redirect."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Replace the current Internet Identity authentication with Google and Apple ID as the only two supported login methods. Display both options as prominent buttons on the login screen. On successful authentication, associate the user's identity with a backend profile (creating one on first login). The existing LoginPrompt, ProfileSetup, and AuthGuard components must be updated to reflect the new providers. Internet Identity references should be removed from all UI-facing components.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "allow users to login using only apple id and google"
        ]
      },
      "acceptanceCriteria": [
        "Login screen shows a 'Continue with Google' button and a 'Continue with Apple' button.",
        "Internet Identity button and references are removed from all visible UI.",
        "On first login, the user is prompted for profile setup (name, phone, location).",
        "On subsequent logins, the user is taken directly to the Home Feed.",
        "AuthGuard correctly identifies authenticated state from the new providers."
      ]
    },
    {
      "id": "REQ-46",
      "text": "Allow any logged-in user (regardless of role) to view the full seller profile when browsing — including the seller's display name, masked phone number, location, verified badge status, average star rating, listed products, and reviews. The seller info on the Listing Detail page and the PublicProfile page must show all these fields to any authenticated viewer. Unauthenticated visitors should see a prompt to log in to view full seller info.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "let anyone that that login to see all the info from the sellers to brouse and see"
        ]
      },
      "acceptanceCriteria": [
        "Authenticated users viewing a listing detail see the seller's name, location, rating, verified badge, and a link to their full profile.",
        "The PublicProfile page renders all seller fields for any authenticated visitor.",
        "Unauthenticated users see a 'Log in to view full seller info' prompt where seller details would appear.",
        "Phone number is masked (e.g., +220 *** **** 78) for privacy."
      ]
    },
    {
      "id": "REQ-47",
      "text": "Generate a unique shareable profile link for every seller. The link should use the seller's principal ID as a URL parameter (e.g., /public-profile?id=<principalId>). On the seller's Profile page and PublicProfile page, display a 'Share My Profile' button that copies this link to the clipboard and shows a confirmation toast. The link should be stable and accessible to anyone — even unauthenticated users can open it but will be prompted to log in to interact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "all sellers can send links to their customers to find them easily"
        ]
      },
      "acceptanceCriteria": [
        "Each seller profile has a unique URL based on their principal ID.",
        "'Share My Profile' / 'Copy Link' button is visible on the seller's own Profile page and on any PublicProfile page.",
        "Clicking the button copies the full URL to the clipboard and shows a success toast ('Link copied!').",
        "Opening the link navigates directly to that seller's PublicProfile page.",
        "Unauthenticated users who open a shared link can view the profile but see a login prompt for interactive actions."
      ]
    },
    {
      "id": "REQ-48",
      "text": "Implement a Like and Follow system for sellers. Users can 'Like' individual listings (heart icon on each listing card and detail page) and 'Follow' a seller from their PublicProfile or Listing Detail page. In the backend, add a `followSeller` function that records follower/following relationships (followerId → sellerId) and an `unfollowSeller` function to remove the relationship. Add a `likeListingAnon` / `likeListing` function to toggle a like on a listing, storing the liker's principal and the listing ID. Expose query functions `getFollowing`, `getFollowers`, and `getLikedListings`. In the Profile page, add a 'Following' tab showing followed sellers. Display follower counts on seller profiles and like counts on listing cards.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "users can like and follow sellers for more products"
        ]
      },
      "acceptanceCriteria": [
        "A heart/like button appears on each listing card and listing detail page; toggling it increments/decrements the like count stored in the backend.",
        "A 'Follow' button appears on every seller's PublicProfile page; authenticated users can follow/unfollow.",
        "The Profile page has a 'Following' tab listing all sellers the current user follows.",
        "Seller profiles display a follower count.",
        "Listing cards and detail pages display a like count.",
        "Backend stores follow relationships and like records persistently in stable maps.",
        "Unauthenticated users who try to like or follow are shown the login prompt."
      ]
    },
    {
      "id": "REQ-49",
      "text": "Allow users to upload and display a profile picture. Add a `profilePicUrl` field (Text, optional) to the UserProfile type in the backend. Add an `updateProfilePic` function that accepts a base64-encoded image string or URL and stores it on the caller's profile. On the Profile page and PublicProfile page, display the profile picture if available, or fall back to the animated initials avatar. Add a camera/upload icon button on the Profile page that opens a file picker to select a photo, converts it to base64, and calls `updateProfilePic`. Display the profile picture in the avatar circle of the BottomNav, AppHeader profile icon, SellerInfo component, and ConversationItem.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "users can add their profile pics for more security"
        ]
      },
      "acceptanceCriteria": [
        "Backend UserProfile type includes an optional `profilePicUrl` field.",
        "The `updateProfilePic` backend function updates the caller's profilePicUrl.",
        "The Profile page shows the current profile picture or initials avatar with an upload button.",
        "Selecting a new photo updates the displayed avatar immediately (optimistic update) and persists to the backend.",
        "Profile pictures appear in SellerInfo, ConversationItem, and PublicProfile components.",
        "File size is validated client-side (max 2 MB) before conversion to base64."
      ]
    },
    {
      "id": "REQ-50",
      "text": "Ensure all user account data, sessions, and listed products are accessible from any device. Since the platform uses principal-based identity (Google/Apple), the same identity resolves to the same principal across devices, so data is inherently cross-device. Update the frontend to not rely on device-local state (localStorage/sessionStorage) for authenticated user data — all profile data, listings, conversations, and follows must be fetched from the backend on every session start. Add a `useGetCallerUserProfile` query that runs on app load for authenticated users to re-hydrate their profile from the backend rather than from local cache.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "all users can log in their account in any devices"
        ]
      },
      "acceptanceCriteria": [
        "Logging in on a second device shows the same profile, listings, and conversations as the first device.",
        "Profile data (name, location, profilePicUrl, listings) is fetched from the backend on app load, not from localStorage.",
        "No critical user state is siloed to a single device's local storage.",
        "Session tokens from Google/Apple resolve to the same principal ID across devices."
      ]
    },
    {
      "id": "REQ-51",
      "text": "Ensure that all listed products persist in the backend indefinitely and are never automatically removed. Listings may only be deleted when the owner explicitly calls the `deleteListing` function from their own 'My Listings' section. Remove any TTL, expiry, or automatic cleanup logic from the backend if present. Inactive/sold listings should remain visible to the owner in their 'My Listings' tab with a status badge (Active / Sold / Paused) even after they are no longer shown in the public Home Feed.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "let all listed products remain unless deleted by the owner in their account"
        ]
      },
      "acceptanceCriteria": [
        "Listings are never automatically deleted or expired by the backend.",
        "Only the listing owner can delete a listing via the `deleteListing` function, which checks the caller's principal.",
        "The owner's 'My Listings' tab shows all listings including sold/paused ones with status badges.",
        "The Home Feed only shows listings with 'active' status, while all others are still stored and visible to the owner.",
        "No scheduled or automatic cleanup code exists in the backend."
      ]
    }
  ],
  "constraints": [
    "Do not use Internet Identity as an authentication method — it must be fully replaced by Google and Apple ID.",
    "Do not break existing listing, messaging, review, and reporting functionality.",
    "Profile pictures must be stored as base64 or URLs in the backend, not as binary blobs requiring separate storage services.",
    "All backend logic must remain in the single Motoko actor (backend/main.mo).",
    "Do not edit files listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Real-time push notifications for new followers or likes.",
    "Email or SMS notifications for follow/like events.",
    "A dedicated 'followers feed' or activity timeline beyond the Following tab.",
    "Video profile pictures or animated avatars.",
    "Third-party delivery or payment integrations in this iteration."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}