{
  "kind": "build_request",
  "title": "Add PWA Install App Banner for Mobile Home Screen Prompting",
  "projectName": "Gambia Market",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-52",
      "text": "Add PWA web app manifest and service worker registration to enable the browser's native 'Add to Home Screen' / install prompt on both iOS Safari and Android Chrome. Create a `frontend/public/manifest.json` with the app name ('Gambia Market'), short name ('GambiaMarket'), start URL, display mode ('standalone'), theme color (matching the app's primary brand green), background color, and icon entries referencing appropriately sized app icons (192×192 and 512×512). Register a minimal service worker in `frontend/public/sw.js` that caches the app shell. Reference the manifest and service worker registration in `frontend/index.html`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "add an 'Install App' banner inside Gambia Market that automatically prompts mobile users to add it to their home screen"
        ]
      },
      "acceptanceCriteria": [
        "A valid `manifest.json` is served from the frontend public directory with correct name, short_name, start_url, display: standalone, theme_color, background_color, and icons fields.",
        "The manifest is linked via a <link rel='manifest'> tag in index.html.",
        "A service worker (`sw.js`) is registered in the app and caches the app shell so the install criteria are met.",
        "On Android Chrome, the browser's native install banner/prompt is triggerable after the PWA install criteria are satisfied.",
        "On iOS Safari, the app is installable via the Share → Add to Home Screen flow with the correct name and icon."
      ]
    },
    {
      "id": "REQ-53",
      "text": "Create a reusable `InstallBanner` React component in `frontend/src/components/InstallBanner.tsx` that listens for the browser's `beforeinstallprompt` event (Android/Chrome) and displays a dismissible bottom banner prompting the user to install the app. The banner should show the Gambia Market logo/name, the text 'Add to Home Screen for a faster experience', an 'Install' button that triggers the deferred prompt, and an 'X' dismiss button. Once dismissed or installed, hide the banner and persist the dismissal in localStorage so it does not reappear in the same session. For iOS (detected via user agent), show a separate instructional banner with the text 'Tap the Share button then \"Add to Home Screen\" to install' with a share icon illustration. Style the banner using the app's West African-inspired color theme (brand green background, gold/amber accent text).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "automatically prompts mobile users to add it to their home screen"
        ]
      },
      "acceptanceCriteria": [
        "The InstallBanner component renders a bottom-fixed banner on mobile viewports (max-width 768px) only.",
        "On Android/Chrome, clicking 'Install' triggers the deferred `beforeinstallprompt` event and initiates the native install dialog.",
        "On iOS Safari, a static instructional banner with share icon and 'Add to Home Screen' instructions is shown instead.",
        "Clicking the dismiss ('X') button hides the banner and stores a 'installBannerDismissed' key in localStorage to suppress future appearances.",
        "The banner does not appear on desktop browsers.",
        "The banner does not appear if the app is already running in standalone mode (i.e., already installed).",
        "The banner is styled consistently with the app's West African-inspired theme (green/gold palette)."
      ]
    },
    {
      "id": "REQ-54",
      "text": "Integrate the `InstallBanner` component into `frontend/src/App.tsx` by rendering it persistently at the root level, outside the main page content area, so it appears on all pages of the app for eligible mobile users.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "add an 'Install App' banner inside Gambia Market"
        ]
      },
      "acceptanceCriteria": [
        "The InstallBanner is rendered in App.tsx at the root level and is visible on every page (Home Feed, Listing Detail, Chat, Profile, etc.).",
        "The banner does not interfere with the BottomNav or AppHeader layout — it should appear above the BottomNav on mobile.",
        "The banner only appears when the install conditions are met and has not been previously dismissed."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "The InstallBanner must not use any external libraries beyond what is already in the project.",
    "The service worker must be minimal — only cache the app shell to satisfy PWA install criteria; do not implement complex offline caching strategies."
  ],
  "nonGoals": [
    "Publishing the app to the Apple App Store or Google Play Store.",
    "Implementing full offline functionality or complex service worker caching strategies.",
    "Push notification support via the service worker.",
    "Modifying the backend for PWA support."
  ],
  "imageRequirements": {
    "required": [
      "Gambia Market app icon — warm green background with a bold white stylized market stall / basket logo mark, square format with rounded corners (app-icon.dim_512x512.png)",
      "Gambia Market app icon smaller variant — same design as the 512px icon (app-icon-192.dim_192x192.png)"
    ],
    "edits": []
  }
}