{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix listing creation and enhance user profile page",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the listing creation flow so that submitting the form after filling all required fields successfully calls the backend createListing mutation, shows a success toast, and navigates the user to the newly created listing or home feed",
      "acceptanceCriteria": [
        "User can fill out all fields in the CreateListing form and successfully submit it without errors",
        "A new listing appears in the backend after form submission",
        "A success toast/notification is shown after successful creation",
        "User is redirected to the new listing detail page or the home feed after creation",
        "Form validation errors are shown clearly for any missing required fields before submission"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CreateListing.tsx",
          "operation": "modify",
          "description": "Debug and fix the form submission flow. Ensure all form fields (title, description, category, subcategory, price, condition, location, photos, bedrooms, propertySize, isFurnished) are correctly mapped to the createListing mutation parameters. Add comprehensive client-side validation that prevents submission when required fields are missing and displays clear error messages. Verify that real-estate-specific fields (bedrooms, propertySize, isFurnished) are only passed when category is 'realEstate'. Handle the mutation response correctly: show a success toast using the toast library, extract the newly created listing ID from the response, and navigate to the listing detail page using App.tsx's page navigation pattern. Add error handling for mutation failures with user-friendly error toasts. Verify the blob-storage component's usage instructions before implementing photo upload."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and ensure the useCreateListing mutation hook correctly calls actor.createListing with all parameters in the correct order matching the backend interface signature. Verify that ExternalBlob objects from the PhotoUpload component are passed directly without transformation. Add proper error handling and return the created listing ID from the mutation response. Ensure the mutation invalidates the 'myListings' and 'allListings' query keys on success to refresh the feed."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Enhance the authenticated user's Profile page to display a comprehensive dashboard showing all user information after login including an editable profile picture, display name, phone number, location, and account creation date with inline editing capability",
      "acceptanceCriteria": [
        "After login, the profile page shows all stored user info: name, phone, location, and avatar",
        "User can upload or change their profile picture from the profile page",
        "Profile picture is persisted to the backend and displayed in the header/avatar after update",
        "All editable fields (name, phone, location) can be updated inline or via an edit form with save confirmation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Profile.tsx",
          "operation": "modify",
          "description": "Add a profile header section at the top of the page displaying the user's profile picture (using ExternalBlob.getDirectURL() if available, or a placeholder avatar), display name, phone number, location, and account creation date formatted as a human-readable string. Add an avatar upload button that opens a file input for image selection. When a new image is selected, convert it to ExternalBlob using ExternalBlob.fromBytes() and call the useUpdateProfilePicture mutation. Show upload progress using ExternalBlob.withUploadProgress(). Display a loading spinner during upload and a success toast on completion. Verify the blob-storage component's usage instructions before implementing avatar upload. Ensure the phone field is displayed (currently only name and location are shown in EditProfileForm)."
        },
        {
          "path": "frontend/src/components/EditProfileForm.tsx",
          "operation": "modify",
          "description": "Add a phone number input field to the form alongside name and location. Update the form submission to call a new useUpdateProfile mutation that accepts name, phone, and location. Add validation for the phone field (required, numeric format). Show a success toast on save and handle validation errors with clear messages."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useUpdateProfilePicture mutation hook that calls actor.updateProfilePicture with an ExternalBlob parameter. Invalidate the 'currentUserProfile' query key on success to refresh the profile display. Add error handling with user-friendly error messages. Add a useUpdateProfile mutation hook that calls actor.saveCallerUserProfile with name, phone, and location parameters, replacing the current updateProfile mutation if it only handles name and location."
        },
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Update the profile avatar display in the header to use the user's profile picture from the currentUserProfile query. If userProfile.profilePic exists, render it using ExternalBlob.getDirectURL() as the image src. Otherwise, show the existing placeholder avatar or user initials. Ensure the avatar updates immediately after a successful profile picture upload by relying on query invalidation."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a 'My Listings' section to the authenticated user's Profile page that lists all listings created by the user with thumbnail, title, price, status badge, and action buttons for Edit, Delete, and Boost, plus a prominent 'Create Listing' button",
      "acceptanceCriteria": [
        "Profile page shows a 'My Listings' tab or section with all listings belonging to the logged-in user",
        "Each listing card displays thumbnail, title, price, and status badge",
        "Edit button navigates to the EditListing page for the selected listing",
        "Delete button removes the listing with a confirmation prompt",
        "A 'Create New Listing' button is visible on the profile page and navigates to the CreateListing page",
        "Empty state is shown when the user has no listings"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProfileTabs.tsx",
          "operation": "modify",
          "description": "Verify that the 'My Listings' tab correctly renders a grid of MyListingCard components for each listing in the myListings query result. Ensure the MyListingCard components receive onEdit, onDelete, and onBoost callback props. Wire the onEdit callback to navigate to the EditListing page with the listing ID. Wire the onDelete callback to call the useDeleteListing mutation after showing a confirmation dialog. Wire the onBoost callback to open the BoostModal with the listing ID. Ensure the empty state message is shown when myListings is empty. Add a 'Create New Listing' button above or within the listings grid that navigates to the CreateListing page."
        },
        {
          "path": "frontend/src/components/MyListingCard.tsx",
          "operation": "modify",
          "description": "Verify that the component correctly displays the listing thumbnail (using ExternalBlob.getDirectURL() for the first photo or a category emoji fallback), title, price, and status badge. Ensure the Edit, Delete, and Boost buttons are wired to call their respective callback props (onEdit, onDelete, onBoost) passed from the parent. Add proper loading and disabled states for the action buttons during mutations."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useDeleteListing mutation hook that calls actor.deleteListing with a listingId parameter. Invalidate the 'myListings' and 'allListings' query keys on success to refresh the feed. Show a success toast after deletion and handle errors with user-friendly messages. Verify that the existing useSetListingBoosted mutation is correctly wired and invalidates the necessary query keys."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a 'Reviews Received' section to the authenticated user's Profile page that displays all reviews left for this user, showing reviewer avatar, name, star rating, comment, and date, plus aggregate stats at the top of the profile",
      "acceptanceCriteria": [
        "Profile page shows a summary stats row with listings count, average rating, review count, and followers",
        "A 'Reviews' tab or section lists all reviews received by the logged-in user",
        "Each review shows reviewer avatar, name, star rating, comment text, and relative timestamp",
        "Empty state is displayed when there are no reviews yet"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Profile.tsx",
          "operation": "modify",
          "description": "Add a ProfileStatsRow component near the top of the profile page (below the profile header section added in REQ-2) that displays four stats: total listings count (from myListings.length), average rating (from userProfile.highestRating converted to a decimal), total reviews count (from reviewsForUser.length), and followers count (from userProfile.followers). Ensure these values are fetched from the relevant React Query hooks and formatted appropriately."
        },
        {
          "path": "frontend/src/components/ProfileTabs.tsx",
          "operation": "modify",
          "description": "Verify that the 'Reviews' tab correctly renders the ReviewsList component with the userId prop set to the current user's principal. Ensure the ReviewsList component is displayed below the tab selector and shows the reviews received by the logged-in user. Confirm that the empty state ('No reviews yet') is shown when there are no reviews."
        },
        {
          "path": "frontend/src/components/ProfileStatsRow.tsx",
          "operation": "modify",
          "description": "Verify that the component correctly receives and displays four stat values: listings (number), rating (number formatted to 1 decimal place with '/5' suffix), reviews (number), and followers (number). Ensure the count-up animation works correctly when values change. Add conditional rendering to show '0' or 'N/A' for missing values gracefully."
        }
      ]
    }
  ]
}