{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add PWA Install App Banner for Mobile Home Screen Prompting",
  "requirements": [
    {
      "id": "REQ-52",
      "summary": "Add PWA web app manifest and service worker registration to enable the browser's native 'Add to Home Screen' install prompt on iOS Safari and Android Chrome",
      "acceptanceCriteria": [
        "A valid `manifest.json` is served from the frontend public directory with correct name, short_name, start_url, display: standalone, theme_color, background_color, and icons fields.",
        "The manifest is linked via a <link rel='manifest'> tag in index.html.",
        "A service worker (`sw.js`) is registered in the app and caches the app shell so the install criteria are met.",
        "On Android Chrome, the browser's native install banner/prompt is triggerable after the PWA install criteria are satisfied.",
        "On iOS Safari, the app is installable via the Share → Add to Home Screen flow with the correct name and icon."
      ],
      "file_operations": [
        {
          "path": "frontend/public/manifest.json",
          "operation": "create",
          "description": "Create a web app manifest with name 'Gambia Market', short_name 'GambiaMarket', start_url '/', display 'standalone', theme_color matching the app's primary brand green (#10b981 or similar from the West African theme), background_color matching the app background, and icons array referencing the generated app icons at /assets/generated/app-icon.dim_512x512.png (512x512) and /assets/generated/app-icon-192.dim_192x192.png (192x192) with type 'image/png' and purpose 'any maskable'."
        },
        {
          "path": "frontend/public/sw.js",
          "operation": "create",
          "description": "Create a minimal service worker that listens for the 'install' event and caches the app shell (index.html, main JavaScript bundle, and core assets) using the Cache API. On 'fetch' events, implement a cache-first strategy for cached resources and network-first for others. Keep the implementation minimal to satisfy PWA installability criteria without complex offline strategies."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add a <link rel='manifest' href='/manifest.json'> tag in the <head> section. Add <meta name='theme-color' content='#10b981'> (or the exact brand green from the theme). Add <meta name='apple-mobile-web-app-capable' content='yes'> and <meta name='apple-mobile-web-app-status-bar-style' content='default'> for iOS support. Add <link rel='apple-touch-icon' href='/assets/generated/app-icon.dim_512x512.png'> for iOS home screen icon."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Register the service worker by adding navigator.serviceWorker.register('/sw.js') inside a conditional check for service worker support (if ('serviceWorker' in navigator)). Wrap the registration in a window 'load' event listener to avoid blocking the initial page render. Handle registration success and errors with console logging."
        }
      ]
    },
    {
      "id": "REQ-53",
      "summary": "Create a reusable InstallBanner React component that listens for the beforeinstallprompt event on Android/Chrome and displays platform-specific install prompts with dismissal and persistence",
      "acceptanceCriteria": [
        "The InstallBanner component renders a bottom-fixed banner on mobile viewports (max-width 768px) only.",
        "On Android/Chrome, clicking 'Install' triggers the deferred `beforeinstallprompt` event and initiates the native install dialog.",
        "On iOS Safari, a static instructional banner with share icon and 'Add to Home Screen' instructions is shown instead.",
        "Clicking the dismiss ('X') button hides the banner and stores a 'installBannerDismissed' key in localStorage to suppress future appearances.",
        "The banner does not appear on desktop browsers.",
        "The banner does not appear if the app is already running in standalone mode (i.e., already installed).",
        "The banner is styled consistently with the app's West African-inspired theme (green/gold palette)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/InstallBanner.tsx",
          "operation": "create",
          "description": "Create a React component that: (1) uses useState to track the deferred beforeinstallprompt event, banner visibility, and installation state; (2) uses useEffect to listen for the 'beforeinstallprompt' event and store the event object, check if the app is already in standalone mode (window.matchMedia('(display-mode: standalone)').matches or window.navigator.standalone), and check localStorage for 'installBannerDismissed'; (3) detects iOS Safari via user agent string (Safari && !CriOS && !FxiOS); (4) renders a bottom-fixed banner (fixed bottom-0 left-0 right-0 z-50) only on mobile (hidden md:hidden) and only if not dismissed, not installed, and either the deferredPrompt exists (Android) or isIOS is true; (5) for Android, display the Gambia Market logo/name (use a small logo or app name text), the text 'Add to Home Screen for a faster experience', an 'Install' button that calls deferredPrompt.prompt() and listens for the user's choice, and an 'X' dismiss button; (6) for iOS, display a share icon (from lucide-react: Share) and the text 'Tap the Share button then \"Add to Home Screen\" to install'; (7) on dismiss, set localStorage 'installBannerDismissed' to 'true' and hide the banner; (8) style the banner with a brand green background (bg-[#10b981] or bg-green-600), gold/amber accent text (text-amber-400), padding, rounded corners on top (rounded-t-xl), shadow-lg, and appropriate button styles (Install button: bg-white text-green-700 font-semibold, X button: text-white hover:text-amber-400)."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Integrate the InstallBanner component into App.tsx at the root level so it appears on all pages for eligible mobile users",
      "acceptanceCriteria": [
        "The InstallBanner is rendered in App.tsx at the root level and is visible on every page (Home Feed, Listing Detail, Chat, Profile, etc.).",
        "The banner does not interfere with the BottomNav or AppHeader layout — it should appear above the BottomNav on mobile.",
        "The banner only appears when the install conditions are met and has not been previously dismissed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import the InstallBanner component and render it at the root level of the App component's return JSX, after the main page content area and outside the routing conditional logic. Position it before the closing fragment/div so it renders on all pages. Ensure it appears above the BottomNav by placing it after the page content but before the BottomNav in the DOM order (or use z-index if needed, which is already handled in the InstallBanner component with z-50). The banner will automatically handle its own visibility logic based on mobile viewport, install state, and dismissal."
        }
      ]
    }
  ]
}